zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/samv70n-pinctrl.h
/* pb1d_ssc_tk */
#define PB1D_SSC_TK \
	SAM_PINMUX(b, 1, d, periph)

/* pb1x_afe1_ad0 */
#define PB1X_AFE1_AD0 \
	SAM_PINMUX(b, 1, x, extra)

/* pb1x_rtc_out1 */
#define PB1X_RTC_OUT1 \
	SAM_PINMUX(b, 1, x, extra)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2a_can0_tx */
#define PB2A_CAN0_TX \
	SAM_PINMUX(b, 2, a, periph)

/* pb2c_usart0_cts */
#define PB2C_USART0_CTS \
	SAM_PINMUX(b, 2, c, periph)

/* pb2d_spi0_npcs0 */
#define PB2D_SPI0_NPCS0 \
	SAM_PINMUX(b, 2, d, periph)

/* pb2x_afe0_ad5 */
#define PB2X_AFE0_AD5 \
	SAM_PINMUX(b, 2, x, extra)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3a_can0_rx */
#define PB3A_CAN0_RX \
	SAM_PINMUX(b, 3, a, periph)

/* pb3b_pmc_pck2 */
#define PB3B_PMC_PCK2 \
	SAM_PINMUX(b, 3, b, periph)

/* pb3c_usart0_rts */
#define PB3C_USART0_RTS \
	SAM_PINMUX(b, 3, c, periph)

/* pb3d_isi_d2 */
#define PB3D_ISI_D2 \
	SAM_PINMUX(b, 3, d, periph)

/* pb3x_afe0_ad2 */
#define PB3X_AFE0_AD2 \
	SAM_PINMUX(b, 3, x, extra)

/* pb3x_supc_wkup12 */
#define PB3X_SUPC_WKUP12 \
	SAM_PINMUX(b, 3, wkup12, wakeup)

/* pb4_gpio */
#define PB4_GPIO \
	SAM_PINMUX(b, 4, gpio, gpio)

/* pb4a_twi1_twd */
#define PB4A_TWI1_TWD \
	SAM_PINMUX(b, 4, a, periph)

/* pb4b_pwmc0_pwmh2 */
#define PB4B_PWMC0_PWMH2 \
	SAM_PINMUX(b, 4, b, periph)

/* pb4c_mlb_clk */
#define PB4C_MLB_CLK \
	SAM_PINMUX(b, 4, c, periph)

/* pb4d_usart1_txd */
#define PB4D_USART1_TXD \
	SAM_PINMUX(b, 4, d, periph)

/* pb4s_jtag_tdi */
#define PB4S_JTAG_TDI \
	SAM_PINMUX(b, 4, s, system)

/* pb5_gpio */
#define PB5_GPIO \
	SAM_PINMUX(b, 5, gpio, gpio)

/* pb5a_twi1_twck */
#define PB5A_TWI1_TWCK \
	SAM_PINMUX(b, 5, a, periph)

/* pb5b_pwmc0_pwml0 */
#define PB5B_PWMC0_PWML0 \
	SAM_PINMUX(b, 5, b, periph)

/* pb5c_mlb_dat */
#define PB5C_MLB_DAT \
	SAM_PINMUX(b, 5, c, periph)

/* pb5d_ssc_td */
#define PB5D_SSC_TD \
	SAM_PINMUX(b, 5, d, periph)

/* pb5s_jtag_tdo */
#define PB5S_JTAG_TDO \
	SAM_PINMUX(b, 5, s, system)

/* pb5s_swd_traceswo */
#define PB5S_SWD_TRACESWO \
	SAM_PINMUX(b, 5, s, system)

/* pb5x_supc_wkup13 */
#define PB5X_SUPC_WKUP13 \
	SAM_PINMUX(b, 5, wkup13, wakeup)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6s_jtag_tms */
#define PB6S_JTAG_TMS \
	SAM_PINMUX(b, 6, s, system)

/* pb6s_swd_swdio */
#define PB6S_SWD_SWDIO \
	SAM_PINMUX(b, 6, s, system)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7s_jtag_tck */
#define PB7S_JTAG_TCK \
	SAM_PINMUX(b, 7, s, system)

/* pb7s_swd_swclk */
#define PB7S_SWD_SWCLK \
	SAM_PINMUX(b, 7, s, system)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8s_supc_xout */
#define PB8S_SUPC_XOUT \
	SAM_PINMUX(b, 8, s, system)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9s_supc_xin */
#define PB9S_SUPC_XIN \
	SAM_PINMUX(b, 9, s, system)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

/* pb12a_pwmc0_pwml1 */
#define PB12A_PWMC0_PWML1 \
	SAM_PINMUX(b, 12, a, periph)

/* pb12d_pcm_pck0 */
#define PB12D_PCM_PCK0 \
	SAM_PINMUX(b, 12, d, periph)

/* pb12s_flash_erase */
#define PB12S_FLASH_ERASE \
	SAM_PINMUX(b, 12, s, system)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_pwmc0_pwml2 */
#define PB13A_PWMC0_PWML2 \
	SAM_PINMUX(b, 13, a, periph)

/* pb13b_pcm_pck0 */
#define PB13B_PCM_PCK0 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13c_usart0_sck */
#define PB13C_USART0_SCK \
	SAM_PINMUX(b, 13, c, periph)

/* pb13x_dacc_dac0 */
#define PB13X_DACC_DAC0 \
	SAM_PINMUX(b, 13, x, extra)

/* pd0_gpio */
#define PD0_GPIO \
	SAM_PINMUX(d, 0, gpio, gpio)

/* pd0b_pwmc1_pwml0 */
#define PD0B_PWMC1_PWML0 \
	SAM_PINMUX(d, 0, b, periph)

/* pd0c_spi1_npcs1 */
#define PD0C_SPI1_NPCS1 \
	SAM_PINMUX(d, 0, c, periph)

/* pd0d_usart0_dcd */
#define PD0D_USART0_DCD \
	SAM_PINMUX(d, 0, d, periph)

/* pd0x_dacc_dac1 */
#define PD0X_DACC_DAC1 \
	SAM_PINMUX(d, 0, x, extra)

/* pd1_gpio */
#define PD1_GPIO \
	SAM_PINMUX(d, 1, gpio, gpio)

/* pd1b_pwmc1_pwmh0 */
#define PD1B_PWMC1_PWMH0 \
	SAM_PINMUX(d, 1, b, periph)

/* pd1c_spi1_npcs2 */
#define PD1C_SPI1_NPCS2 \
	SAM_PINMUX(d, 1, c, periph)

/* pd1d_usart0_dtr */
#define PD1D_USART0_DTR \
	SAM_PINMUX(d, 1, d, periph)

/* pd2_gpio */
#define PD2_GPIO \
	SAM_PINMUX(d, 2, gpio, gpio)

/* pd2b_pwmc1_pwml1 */
#define PD2B_PWMC1_PWML1 \
	SAM_PINMUX(d, 2, b, periph)

/* pd2c_spi1_npcs3 */
#define PD2C_SPI1_NPCS3 \
	SAM_PINMUX(d, 2, c, periph)

/* pd2d_usart0_dsr */
#define PD2D_USART0_DSR \
	SAM_PINMUX(d, 2, d, periph)

/* pd3_gpio */
#define PD3_GPIO \
	SAM_PINMUX(d, 3, gpio, gpio)

/* pd3b_pwmc1_pwmh1 */
#define PD3B_PWMC1_PWMH1 \
	SAM_PINMUX(d, 3, b, periph)

/* pd3c_uart4_txd */
#define PD3C_UART4_TXD \
	SAM_PINMUX(d, 3, c, periph)

/* pd3d_usart0_ri */
#define PD3D_USART0_RI \
	SAM_PINMUX(d, 3, d, periph)

/* pd4_gpio */
#define PD4_GPIO \
	SAM_PINMUX(d, 4, gpio, gpio)

/* pd4b_pwmc1_pwml2 */
#define PD4B_PWMC1_PWML2 \
	SAM_PINMUX(d, 4, b, periph)

/* pd4c_trace_d0 */
#define PD4C_TRACE_D0 \
	SAM_PINMUX(d, 4, c, periph)

/* pd4d_usart2_dcd */
#define PD4D_USART2_DCD \
	SAM_PINMUX(d, 4, d, periph)

/* pd5_gpio */
#define PD5_GPIO \
	SAM_PINMUX(d, 5, gpio, gpio)

/* pd5b_pwmc1_pwmh2 */
#define PD5B_PWMC1_PWMH2 \
	SAM_PINMUX(d, 5, b, periph)

/* pd5c_trace_d1 */
#define PD5C_TRACE_D1 \
	SAM_PINMUX(d, 5, c, periph)

/* pd5d_usart2_dtr */
#define PD5D_USART2_DTR \
	SAM_PINMUX(d, 5, d, periph)

/* pd6_gpio */
#define PD6_GPIO \
	SAM_PINMUX(d, 6, gpio, gpio)

/* pd6b_pwmc1_pwml3 */
#define PD6B_PWMC1_PWML3 \
	SAM_PINMUX(d, 6, b, periph)

/* pd6c_trace_d2 */
#define PD6C_TRACE_D2 \
	SAM_PINMUX(d, 6, c, periph)

/* pd6d_usart2_dsr */
#define PD6D_USART2_DSR \
	SAM_PINMUX(d, 6, d, periph)

/* pd8_gpio */
#define PD8_GPIO \
	SAM_PINMUX(d, 8, gpio, gpio)

/* pd8b_pwmc0_pwmfi1 */
#define PD8B_PWMC0_PWMFI1 \
	SAM_PINMUX(d, 8, b, periph)

/* pd8d_trace_clk */
#define PD8D_TRACE_CLK \
	SAM_PINMUX(d, 8, d, periph)

/* pd9_gpio */
#define PD9_GPIO \
	SAM_PINMUX(d, 9, gpio, gpio)

/* pd9b_pwmc0_pwmfi2 */
#define PD9B_PWMC0_PWMFI2 \
	SAM_PINMUX(d, 9, b, periph)

/* pd9c_afe1_adtrg */
#define PD9C_AFE1_ADTRG \
	SAM_PINMUX(d, 9, c, periph)

